//Напишите программу, которая принимает на вход пятизначное число и проверяет, является ли оно палиндромом. Через строку решать нельзя.
//14212 -> нет
//12821 -> да
//23432 -> да

Console.Write("Введите пятизначное число: ");
int numA = Convert.ToInt32(Console.ReadLine());

int z = numA/1%10;
int x = numA/10%10;
int c = numA/100%100%10;
int v = numA/1000%100%10%10;
int b = numA/10000%100%10%10%10;

if ((b==z) && (x==v)) Console.WriteLine("Число является палиндромом.");
else Console.WriteLine("Число не является палиндромом.");